src/Reports/МониторПроизводительностиКонфигурации/МониторПроизводительностиКонфигурации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>МониторПроизводительностиКонфигурации</name>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтчета</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильКлючевыхОпераций</name>
    <type>
      <types>CatalogRef.ПрофилиКлючевыхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоКлючевыеОперацииПрофиля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоБазДляРаспределения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимРаботыКонфигурации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБазовоеЗначение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаспределениеПользователейXML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоЗамеров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючеваяОперация</name>
    <type>
      <types>CatalogRef.КлючевыеОперацииЦентрМониторинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборПоЧастойВерсииПлатформы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АнализироватьПлатформу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИнформационнойБазы</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
</mdclass:Report>

src/Reports/МониторПроизводительностиКонфигурации/Forms/ФормаНастройкиОтчета/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Отчет.Конфигурация = ЭтотОбъект.Параметры.Конфигурация;
    Отчет.ПериодОтчета = ЭтотОбъект.Параметры.ПериодОтчета;
    Отчет.ПрофильКлючевыхОпераций = ЭтотОбъект.Параметры.ПрофильКлючевыхОпераций;
    Отчет.ТолькоКлючевыеОперацииПрофиля = ЭтотОбъект.Параметры.ТолькоКлючевыеОперацииПрофиля;
    Отчет.МинимальноеКоличествоБазДляРаспределения = ЭтотОбъект.Параметры.МинимальноеКоличествоБазДляРаспределения;
    Отчет.РежимРаботыКонфигурации = ЭтотОбъект.Параметры.РежимРаботыКонфигурации;
    Отчет.ИспользоватьБазовоеЗначение = ЭтотОбъект.Параметры.ИспользоватьБазовоеЗначение;
	Отчет.МинимальноеКоличествоЗамеров = ЭтотОбъект.Параметры.МинимальноеКоличествоЗамеров;
	Отчет.КлючеваяОперация = ЭтотОбъект.Параметры.КлючеваяОперация;
	Отчет.ОтборПоЧастойВерсииПлатформы = ЭтотОбъект.Параметры.ОтборПоЧастойВерсииПлатформы;
	Отчет.АнализироватьПлатформу = ЭтотОбъект.Параметры.АнализироватьПлатформу;
	СтатусИнформационнойБазы.ЗагрузитьЗначения(ЭтотОбъект.Параметры.СтатусИнформационнойБазы.ВыгрузитьЗначения());
    
    Если ЗначениеЗаполнено(ЭтотОбъект.Параметры.РаспределениеПользователей) Тогда
        РаспределениеПользователейИзXML(ЭтотОбъект.Параметры.РаспределениеПользователей);
    КонецЕсли;
            
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
    
    ПараметрыЗакрытия = Новый Структура;
    ПараметрыЗакрытия.Вставить("Конфигурация", Отчет.Конфигурация);
    ПараметрыЗакрытия.Вставить("ПериодОтчета", Отчет.ПериодОтчета);
    ПараметрыЗакрытия.Вставить("ПрофильКлючевыхОпераций", Отчет.ПрофильКлючевыхОпераций);
    ПараметрыЗакрытия.Вставить("ТолькоКлючевыеОперацииПрофиля", Отчет.ТолькоКлючевыеОперацииПрофиля);
    ПараметрыЗакрытия.Вставить("МинимальноеКоличествоБазДляРаспределения", Отчет.МинимальноеКоличествоБазДляРаспределения);
    ПараметрыЗакрытия.Вставить("РежимРаботыКонфигурации", Отчет.РежимРаботыКонфигурации);
    ПараметрыЗакрытия.Вставить("ИспользоватьБазовоеЗначение", Отчет.ИспользоватьБазовоеЗначение);
	ПараметрыЗакрытия.Вставить("МинимальноеКоличествоЗамеров", Отчет.МинимальноеКоличествоЗамеров);
	ПараметрыЗакрытия.Вставить("КлючеваяОперация", Отчет.КлючеваяОперация);
	ПараметрыЗакрытия.Вставить("ОтборПоЧастойВерсииПлатформы", Отчет.ОтборПоЧастойВерсииПлатформы);
	ПараметрыЗакрытия.Вставить("АнализироватьПлатформу", Отчет.АнализироватьПлатформу);
	ПараметрыЗакрытия.Вставить("СтатусИнформационнойБазы", СтатусИнформационнойБазы.ВыгрузитьЗначения());
    ПараметрыЗакрытия.Вставить("РаспределениеПользователей", РаспределениеПользователейВXML()); 
    
    ЭтотОбъект.Закрыть(ПараметрыЗакрытия);
    
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
    ЭтотОбъект.Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция РаспределениеПользователейВXML()
    
    ТаблицаЗначений = РеквизитФормыВЗначение("РаспределениеПользователей", Тип("ТаблицаЗначений"));
    
    Поток = Новый ЗаписьXML();
	Поток.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(Поток, ТаблицаЗначений);
    
	Возврат Поток.Закрыть();
    
КонецФункции

&НаСервере
Процедура РаспределениеПользователейИзXML(СтрокаXML)
    
    ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	ТаблицаЗначений = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
    
    ЗначениеВРеквизитФормы(ТаблицаЗначений, "РаспределениеПользователей");
    
КонецПроцедуры

#КонецОбласти
